{
  "ir_version": "1.0",
  "project": "omnivoice-deepgram",
  "repository": "https://github.com/agentplexus/omnivoice-deepgram",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-01-19",
      "highlights": [
        { "description": "OmniVoice STT provider for Deepgram with real-time streaming transcription support" }
      ],
      "added": [
        { "description": "Streaming STT provider implementing `stt.StreamingProvider` interface", "commit": "f8fb090" },
        { "description": "Real-time transcription via Deepgram WebSocket API", "commit": "f8fb090" },
        { "description": "Support for telephony audio formats: mu-law, a-law, linear16, FLAC, Opus, MP3", "commit": "f8fb090" },
        { "description": "Interim and final transcription results with word-level timing", "commit": "f8fb090" },
        { "description": "Speech start/end detection via `SpeechStarted` and `UtteranceEnd` callbacks", "commit": "f8fb090" },
        { "description": "Speaker diarization support with configurable max speakers", "commit": "f8fb090" },
        { "description": "Keyword boosting for domain-specific vocabulary", "commit": "f8fb090" },
        { "description": "Configuration converter from OmniVoice `TranscriptionConfig` to Deepgram options", "commit": "f8fb090" }
      ],
      "documentation": [
        { "description": "README with installation, usage examples, and configuration reference", "commit": "3cc5c41" },
        { "description": "Package documentation with streaming transcription examples", "commit": "3cc5c41" }
      ]
    }
  ]
}
