{
  "ir_version": "1.0",
  "project": "omnivoice-deepgram",
  "repository": "https://github.com/agentplexus/omnivoice-deepgram",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "Text-to-Speech (TTS) provider with streaming support and LLM integration" }
      ],
      "added": [
        { "description": "TTS provider implementing `tts.Provider` and `tts.StreamingProvider` interfaces", "commit": "0f554ae" },
        { "description": "`Synthesize` method for non-streaming TTS via Deepgram REST API", "commit": "0f554ae" },
        { "description": "`SynthesizeStream` method for streaming TTS via Deepgram WebSocket API", "commit": "0f554ae" },
        { "description": "`SynthesizeFromReader` method for streaming LLM output directly to TTS", "commit": "0f554ae" },
        { "description": "`ListVoices` method returning available Deepgram Aura voices", "commit": "0f554ae" },
        { "description": "`GetVoice` method for voice lookup by ID", "commit": "0f554ae" },
        { "description": "Automatic sentence splitting for natural speech synthesis", "commit": "0f554ae" },
        { "description": "Support for TTS output formats: mp3, linear16, mulaw, alaw, opus, flac", "commit": "0f554ae" },
        { "description": "Configuration converter from OmniVoice `SynthesisConfig` to Deepgram options", "commit": "0f554ae" },
        { "description": "Static voice list with 17 Aura voices (Aura 1 and Aura 2)", "commit": "0f554ae" },
        { "description": "TTS conformance tests using omnivoice `providertest` package", "commit": "854e14d" },
        { "description": "STT conformance tests using omnivoice `providertest` package", "commit": "854e14d" }
      ],
      "fixed": [
        { "description": "STT provider initialization uses `sync.Once` to prevent flag redefinition panic", "commit": "8a584f7" }
      ],
      "documentation": [
        { "description": "README updated with TTS usage examples and feature tables", "commit": "f0b3696" },
        { "description": "PRD.md updated with TTS implementation status", "commit": "f0b3696" },
        { "description": "TRD_TTS.md technical design document for TTS implementation", "commit": "f0b3696" },
        { "description": "ROADMAP.md tracking planned features (STT Batch) and completed items", "commit": "f0b3696" }
      ],
      "tests": [
        { "description": "Unit tests for TTS config conversion functions", "commit": "854e14d" },
        { "description": "Unit tests for TTS provider methods", "commit": "854e14d" },
        { "description": "Unit tests for sentence splitting logic", "commit": "854e14d" },
        { "description": "Integration tests for TTS (requires DEEPGRAM_API_KEY)", "commit": "854e14d" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/agentplexus/omnivoice` from v0.2.0 to v0.3.0", "commit": "0f554ae" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-19",
      "highlights": [
        { "description": "OmniVoice STT provider for Deepgram with real-time streaming transcription support" }
      ],
      "added": [
        { "description": "Streaming STT provider implementing `stt.StreamingProvider` interface", "commit": "f8fb090" },
        { "description": "Real-time transcription via Deepgram WebSocket API", "commit": "f8fb090" },
        { "description": "Support for telephony audio formats: mu-law, a-law, linear16, FLAC, Opus, MP3", "commit": "f8fb090" },
        { "description": "Interim and final transcription results with word-level timing", "commit": "f8fb090" },
        { "description": "Speech start/end detection via `SpeechStarted` and `UtteranceEnd` callbacks", "commit": "f8fb090" },
        { "description": "Speaker diarization support with configurable max speakers", "commit": "f8fb090" },
        { "description": "Keyword boosting for domain-specific vocabulary", "commit": "f8fb090" },
        { "description": "Configuration converter from OmniVoice `TranscriptionConfig` to Deepgram options", "commit": "f8fb090" }
      ],
      "documentation": [
        { "description": "README with installation, usage examples, and configuration reference", "commit": "3cc5c41" },
        { "description": "Package documentation with streaming transcription examples", "commit": "3cc5c41" }
      ]
    }
  ]
}
